[
    {
        "id": 1,
        "Question": "Difference between javascript and nodejs",
        "Ans": "JavaScript is a programming language. It is running in any web browser with a proper browser engine. It is an interpreter and environment for JavaScript with some specific useful libraries which JavaScript programming can use separately.Mainly using for any client-side activity for a web application, like possible attribute validation or refreshing the page in a specific interval or provide some dynamic changes in web pages without refreshing the page. It mainly used for accessing or performing any non-blocking operation of any operating system, like creating or executing a shell script or accessing any hardware-specific information or running any backend job.JavaScript running any engine like Spider monkey (FireFox), JavaScript Core (Safari), V8 (Google Chrome).Node JS only run in a V8 engine which mainly used by google chrome. And javascript program which will be written under this Node JS will be always run in V8 Engine."
    },
    {
        "id": 2,
        "Question": "When should you use nodejs and when should you use mongodb",
        "Ans": "NodeJS and MongoDB are two different process.NodeJS is a JavaScript runtime environment. It's actually helps JavaScript to run outside of server. It's used in server side development.But, MongoDB is NoSQL database which is document oriented. It represents data as of JSON documents. It's used for store data.The summary is MongoDB is a database where we can store data and NodeJS helps us to to connect our client site to database by it's server site. "
    },
    {
        "id": 3,
        "Question": "Differences between sql and nosql databases.",
        "Ans": "SQL databases are relational, NoSQL databases are non-relational.SQL databases use structured query language and have a predefined schema. NoSQL databases have dynamic schemas for unstructured data.SQL databases are vertically scalable, while NoSQL databases are horizontally scalable.SQL databases are table-based, while NoSQL databases are document, key-value, graph, or wide-column stores.SQL databases are better for multi-row transactions, while NoSQL is better for unstructured data like documents or JSON."
    },
    {
        "id": 4,
        "Question": "What is the purpose of jwt and how does it work",
        "Ans": "JWT, or JSON Web Token, is an open standard used to share security information between two parties — a client and a server.JWTs differ from other web tokens in that they contain a set of claims. Claims are used to transmit information between two parties. What these claims are depends on the use case at hand. For example, a claim may assert who issued the token, how long it is valid for, or what permissions the client has been granted.In short, JWTs are used as a secure way to authenticate users and share information.Typically, a private key, or secret, is used by the issuer to sign the JWT. The receiver of the JWT will verify the signature to ensure that the token hasn’t been altered after it was signed by the issuer. It is difficult for unauthenticated sources to guess the signing key and attempt to change the claims within the JWT."
    }
]